Revit 2024 API
SpecTypeId.SurfaceAreaPerUnitLength Property
 Surface Area per Unit Length, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId SurfaceAreaPerUnitLength { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceAreaPerUnitLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SurfaceAreaPerUnitLength {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace